// ===== Базовые объекты =====
const BASE_OBJECTS = [
  { 
    id: 'agatu', 
    name: 'Главный корпус АГАТУ', 
    type: 'building', 
    lat: 62.010346, 
    lng: 129.686212,
    desc: 'Учебный корпус. Нажмите "Внутренняя карта", чтобы посмотреть этажи и переходы.', 
    icon: '🏫 ',
    // Список всех этажей и переходов
 floors: [
  // ================= СТАРЫЙ КОРПУС =================
  { 
    name: 'Старый корпус: 1 этаж', 
    img: 'photos/old_floor1.png',
    rooms: [
      { name: '1.101', desc: 'Главный инженер / Управление ЖКХ', x: 906, y: 416 },
      { name: '1.102', desc: 'Компьютерный класс', x: 906, y: 310 },
      { name: '1.103', desc: 'Кабинет истории и философии', x: 836, y: 289 },
      { name: '1.104', desc: 'Отдел административно-хозяйственного обеспечения', x: 780, y: 286 },
      { name: '1.107', desc: 'Кабинет', x: 394, y: 286 },
      { name: 'Столовая', desc: 'Столовая', x: 519, y: 380 },
      { name: 'Вахта', desc: 'Вахта', x: 531, y: 256 },
      { name: 'Гардероб', desc: 'Гардероб', x: 609, y: 120 },
      { name: 'Аврора', desc: 'Аврора мед пункт', x: 376, y: 426 },
      { name: '1.108', desc: 'Кабинет менеджмента', x: 326, y: 284 },
      { name: '1.109', desc: 'Кабинет', x: 297, y: 284 },
      { name: '1.110', desc: 'Кабинет', x: 256, y: 284 },
      { name: '1.111', desc: 'Кабинеты', x: 214, y: 284 },
      { name: '1.112', desc: 'Институт доп. образования', x: 148, y: 284 },
      { name: '1.113', desc: 'Кафедра пищевых технологий', x: 88, y: 284 },
      { name: '1.114.1', desc: 'Учебная аудитория', x: 43, y: 411 },
      { name: '1.114.2', desc: 'Учебная аудитория', x: 43, y: 284 },
      { name: '1.115', desc: 'Институт доп. образования', x: 103, y: 421 },
      { name: '1.116', desc: 'Подсобная', x: 145, y: 417 },
      { name: '1.117', desc: 'Кабинет', x: 173, y: 417 },
      { name: '1.118', desc: 'Кабинет', x: 271, y: 417 },
      { name: '1.119', desc: 'Кафедра физвоспитания', x: 324, y: 417 },
      { name: '1.122', desc: 'Хранение оборудования', x: 430, y: 417 },
      { name: '1.123', desc: 'Аудитория Якутский гормолзавод', x: 577, y: 370 },
      { name: '1.124', desc: 'Автопарк', x: 747, y: 414 },
      { name: '1.125', desc: 'Подсобное помещение', x: 782, y: 402 },
      { name: '1.126', desc: 'Подсобное помещение', x: 782, y: 424 },
      { name: '1.127', desc: 'WC', x: 782, y: 448 },
      { name: '1.128', desc: 'Отдел кадров', x: 885, y: 599 },
      { name: '1.129', desc: 'Общий отдел', x: 962, y: 757 },
      { name: '1.130', desc: 'Отдел тех. обеспечения', x: 964, y: 667 }
    ]
  },
  { 
    name: 'Старый корпус: 2 этаж', 
    img: 'photos/old_floor2.png',
    rooms: [
      { name: '1.234', desc: 'Кабинет', x: 856, y: 457 },
      { name: '1.233-1', desc: 'Подсобное помещение', x: 794, y: 400 },
      { name: '1.233-2', desc: '1.233-2', x: 819, y: 453 },
      { name: 'WC', desc: 'WS', x: 775, y: 406 },
      { name: 'Туалет', desc: 'Женский', x: 794, y: 425 },
      { name: '1.201', desc: 'Факультет ФАБ', x: 909, y: 440 },
      { name: '1.210', desc: 'Гардероб', x: 587, y: 264 },
      { name: '1.227', desc: 'Учебная аудитория', x: 590, y: 423 },
      { name: '2 этаж актовый зал', desc: 'Актовый зал', x: 615, y: 148 },
      { name: '1.202', desc: 'Компьютерный класс', x: 913, y: 316 },
      { name: '1.203', desc: 'Лаборатория мяса и рыбы', x: 847, y: 292 },
      { name: '1.204', desc: 'Учебная аудитория (лекционная)', x: 762, y: 289 },
      { name: '1.205', desc: 'Хранение оборудования', x: 676, y: 319 },
      { name: '1.206', desc: 'Преподавательская', x: 677, y: 266 },
      { name: '1.207', desc: 'Гардероб', x: 641, y: 264 },
      { name: '1.208', desc: '?', x: 630, y: 311 },
      { name: '1.209', desc: '?', x: 594, y: 311 },
      { name: '1.226', desc: 'Учебная аудитория', x: 530, y: 425 },
      { name: '1.211', desc: '?', x: 534, y: 271 },
      { name: '1.225', desc: '?', x: 451, y: 411 },
      { name: '1.213', desc: 'Декан агротехнологического факультета', x: 487, y: 303 },
      { name: '1.214', desc: 'Учебная аудитория', x: 397, y: 299 },
      { name: '1.215', desc: 'Преподовательская кафедра социально-гуманитарных дисциплин', x: 339, y: 304 },
      { name: '1.216', desc: 'Научно-иследовательская лабаратория', x: 310, y: 301 },
      { name: '1.217', desc: 'Компьютерный класс', x: 256, y: 304 },
      { name: '1.218', desc: 'Кафедра отраслевая экономика и управление Преподовательская', x: 177, y: 303 },
      { name: 'Туалет', desc: 'М', x: 196, y: 442 },
      { name: '1.222', desc: 'Помещение для хранения', x: 196, y: 418 },
      { name: '1.219', desc: 'Учебная аудитория', x: 86, y: 306 },
      { name: '1.219-А', desc: 'Заведующий кафедрой Отраслевая экономика и управление', x: 124, y: 307 },
      { name: '1.220', desc: 'Учебная аудитория', x: 59, y: 441 },
      { name: 'ФАБ', desc: 'Деканат ФАБ', x: 122, y: 459 },
      { name: '1.223', desc: 'Учебная аудитория', x: 300, y: 458 },
      { name: '1.224', desc: 'Военно-учетный паспортный стол', x: 455, y: 438 },
      { name: '1.228', desc: 'Преподовательская ПТИП', x: 660, y: 417 },
      { name: '1.229', desc: 'Кафедра ПТИП', x: 680, y: 415 },
      { name: '1.231', desc: 'Кабинет', x: 762, y: 402 },
      { name: '1.230', desc: 'Учебная аудитория', x: 700, y: 412 },
    ]
  },
  { 
    name: 'Старый корпус: 3 этаж', 
    img: 'photos/old_floor3.png',
    rooms: [
      { name: '1.301.1', desc: 'Лабаратория', x: 861, y: 472 },
      { name: '1.301', desc: 'Учебная аудитория', x: 910, y: 450 },
      { name: '?', desc: 'Подсобное помещение', x: 779, y: 417 },
      { name: '1.303', desc: 'Учебная аудитория', x: 909, y: 324 },
      { name: '1.304', desc: 'Аудитория им. Чугунова', x: 833, y: 299 },
      { name: '1.305', desc: 'Лаборантская', x: 766, y: 300 },
      { name: '1.306', desc: 'Кабинет', x: 707, y: 301 },
      { name: '1.307', desc: 'Кабинет', x: 679, y: 301 },
      { name: '1.308', desc: 'Кабинет', x: 623, y: 300 },
      { name: '1.309', desc: 'Архив ВКР', x: 537, y: 298 },
      { name: '1.310', desc: 'Кафедра зоотехнии Им. А.В. Чугунова', x: 492, y: 299 },
      { name: '1.311', desc: 'Лаборатория молока', x: 416, y: 297 },
      { name: '1.312', desc: 'Лаборантская', x: 343, y: 297 },
      { name: '1.313', desc: 'Лаборатория кормления', x: 286, y: 297 },
      { name: '1.314', desc: 'Лаборантская', x: 228, y: 296 },
      { name: '1.315', desc: 'Класс лесных машин', x: 165, y: 295 },
      { name: '1.316', desc: 'Аудитория Якутский скот', x: 62, y: 294 },
      { name: '1.317', desc: 'Кабинет теории государства', x: 48, y: 436 },
      { name: '1.318', desc: 'Класс лесных машин Ponsse', x: 111, y: 471 },
      { name: '1.319', desc: 'Подсобное помещение', x: 193, y: 420 },
      { name: '1.320', desc: 'Деканат лесного комплекса', x: 301, y: 463 },
      { name: '1.321', desc: 'Декан лесного комплекса', x: 344, y: 461 },
      { name: '1.322', desc: 'Заведующий кафедрой', x: 411, y: 458 },
      { name: '1.325', desc: 'Актовый зал 3 этаж', x: 625, y: 468 },
      { name: '1.326', desc: 'Методист заочного обучения', x: 766, y: 418 },
      { name: '1.327', desc: 'Подсобное помещение', x: 797, y: 409 },
      { name: '1.328', desc: 'Преподавательская', x: 823, y: 416 }
    ]
  },

  // ================= ПЕРЕХОДЫ =================
  { 
    name: 'Переход: 2 этаж', 
    img: 'photos/passage_2.png',
    rooms: [
      { name: '1.235', desc: 'Бухгалтерия', x: 856, y: 218 },
      { name: '1.236', desc: 'Планово-экономический отдел', x: 637, y: 215 },
      { name: '1.237', desc: 'Касса', x: 393, y: 213 },
      { name: '1.238', desc: 'Отдел бух. учета', x: 182, y: 210 },
      { name: '1.239', desc: 'Главный бухгалтер', x: 188, y: 599 },
      { name: 'Туалет', desc: 'М', x: 710, y: 522 },
      { name: 'Туалет', desc: 'Ж', x: 612, y: 522 }
    ]
  },
  { 
    name: 'Переход: 3 этаж', 
    img: 'photos/passage_3.png',
    rooms: [] 
  },

  // ================= НОВЫЙ КОРПУС =================
  {
    name: 'Новый корпус: 1 этаж', 
    img: 'photos/new_floor1.png', 
    rooms: [
      { name: 'Вахта', desc: 'Вахат', x: 179, y: 390 },
      { name: 'Гардероб', desc: 'Гардероб', x: 116, y: 472 },
      { name: 'Веткамера', desc: 'Веткамера', x: 285, y: 467 },
      { name: 'Лифт', desc: 'Маленький', x: 285, y: 421 },
      { name: 'Лифт', desc: 'Большой', x: 284, y: 443 },
      { name: 'Туалет 1', desc: 'Ж', x: 285, y: 320 },
      { name: 'Туалет 1', desc: 'М', x: 284, y: 354 },
      { name: '2.101', desc: 'Служба безопасности', x: 310, y: 425 },
      { name: '2.102', desc: 'Кабинет гуманитарных дисциплин', x: 388, y: 527 },
      { name: '2.102.A', desc: 'Преподовательское', x: 331, y: 441 },
      { name: '2.103', desc: 'Кабинет', x: 378, y: 463 },
      { name: '2.104', desc: 'Кабинет', x: 399, y: 463 },
      { name: '2.105', desc: 'Кабинет', x: 477, y: 441 },
      { name: '2.106', desc: 'Кабинет', x: 531, y: 442 },
      { name: '2.107', desc: 'Начальник научной части', x: 560, y: 438 },
      { name: '2.108', desc: 'Служба по развитию', x: 594, y: 439 },
      { name: 'Туалет 2', desc: 'М', x: 639, y: 425 },
      { name: 'Туалет 2', desc: 'Ж', x: 640, y: 457 },
      { name: 'Активисты', desc: 'ПАТРИОТ14', x: 782, y: 329 },
      { name: 'Активисты', desc: 'ППОС', x: 783, y: 112 },
      { name: 'Актовый зал', desc: 'Большой', x: 825, y: 253 },
      { name: '2.110-A', desc: 'Колледж технологий и управления преподовательская', x: 639, y: 512 },
      { name: '2.110', desc: 'Колледж технологий и управления', x: 639, y: 561 },
      { name: '2.111', desc: 'Музей АГАТУ', x: 638, y: 612 },
      { name: '2.112', desc: 'Отдел комплектования литературы', x: 637, y: 676 },
      { name: '2.113', desc: 'Кабинет-музей Чугунова', x: 635, y: 722 },
      { name: '2.114', desc: 'Помещение для курсового проектирования', x: 728, y: 710 },
      { name: '2.115', desc: 'Книгохранилище', x: 729, y: 629 },
      { name: '2.116', desc: 'Директор зам директора', x: 730, y: 564 },
      { name: '2.119', desc: 'Электрощитовая', x: 628, y: 337 },
      { name: '2.120', desc: '?', x: 596, y: 336 },
      { name: '2.121', desc: 'Лаборатория генетики', x: 538, y: 336 },
      { name: '2.122', desc: 'Лаборатория генетики', x: 476, y: 337 },
      { name: '2.123', desc: 'Приемная комиссия', x: 407, y: 338 },
      { name: '2.124', desc: 'Центральная приемная комиссия', x: 338, y: 338 }
    ] 
  },
  { 
    name: 'Новый корпус: 2 этаж', 
    img: 'photos/new_floor2.png', 
    rooms: [
      { name: '2.201', desc: 'Приемная', x: 147, y: 431 },
      { name: 'Веткамера', desc: 'Веткамера', x: 281, y: 453 },
      { name: 'Лифт', desc: 'Большой', x: 280, y: 430 },
      { name: 'Лифт', desc: 'Маленький', x: 280, y: 406 },
      { name: 'Учебно-научные лабаратории', desc: 'Посторонним вход воспрещен!', x: 294, y: 375 },
      { name: 'Учебно-научные лабаратории', desc: 'Посторонним вход воспрещен!', x: 611, y: 375 },
      { name: 'Туалет', desc: 'М', x: 646, y: 413 },
      { name: 'Туалет', desc: 'Ж', x: 646, y: 447 },
      { name: '2.211', desc: 'Заведующий', x: 643, y: 586 },
      { name: '2.213', desc: 'Книгохранилище', x: 641, y: 666 },
      { name: '2.214', desc: 'Библиотека', x: 737, y: 647 },
      { name: '2.215', desc: 'Книгохранилище', x: 714, y: 503 },
      { name: '2.216', desc: 'Столовая / Лаборатории', x: 726, y: 251 },
      { name: '2.217', desc: 'Книгохранилище', x: 642, y: 327 }
    ] 
  },
  { 
    name: 'Новый корпус: 3 этаж', 
    img: 'photos/new_floor3.png', 
    rooms: [
      { name: '2.302', desc: 'СМИ АГАТУ', x: 85, y: 404 },
      { name: 'Туалет 1', desc: 'Ж', x: 352, y: 122 },
      { name: '2.301', desc: 'Кабинет', x: 89, y: 304 },
      { name: 'Лифт', desc: 'Большой', x: 353, y: 298 },
      { name: 'Лифт', desc: 'Маленький', x: 353, y: 263 },
      { name: '2.303', desc: 'Зал Ученого совета', x: 193, y: 372 },
      { name: '2.304', desc: 'Лаборатория неорганической химии', x: 445, y: 295 },
      { name: '2.305', desc: 'Лаборантская', x: 523, y: 296 },
      { name: '2.306', desc: 'Лаборатория физики', x: 640, y: 287 },
      { name: '2.307', desc: 'Венткамера', x: 747, y: 268 },
      { name: 'Туалет 2', desc: 'Ж', x: 811, y: 266 },
      { name: 'Туалет 2', desc: 'М', x: 814, y: 315 },
      { name: '2.308', desc: 'Учебная аудитория', x: 811, y: 484 },
      { name: '2.307-1', desc: 'Академия ЕГЭ', x: 804, y: 389 },
      { name: '2.309', desc: 'Кабинет математики', x: 935, y: 678 },
      { name: '2.310', desc: 'Учебная аудитория (лекционная)', x: 932, y: 513 },
      { name: '2.312', desc: 'Кабинет иностранного языка', x: 933, y: 388 },
      { name: '2.313', desc: 'Лаборатория программирования', x: 933, y: 292 },
      { name: '2.314', desc: 'Лаборатория пищевой биотехнологии', x: 948, y: 139 },
      { name: '2.315', desc: 'Лаборатория сублимационной сушки', x: 897, y: 139 },
      { name: '2.316', desc: 'Кафедра социально-гуманитарных дисциплин', x: 808, y: 138 },
      { name: '2.317', desc: 'Преподавательская', x: 751, y: 139 },
      { name: '2.318', desc: 'Лаборатория биофизики', x: 676, y: 141 },
      { name: '2.319', desc: 'Преподавательская', x: 595, y: 145 },
      { name: '2.320', desc: 'Лаборатория органической химии', x: 501, y: 145 },
      { name: '2.321', desc: 'Лаборантская', x: 420, y: 146 },
      { name: '2.322', desc: 'Венткамера', x: 354, y: 329 },
      { name: '2.324', desc: 'Лаборатории метрологии', x: 263, y: 150 }
    ]
   }
  ]
 },

 {
    id: 'manezh', 
    name: 'Манеж', 
    type: 'building', 
    lat: 62.010310, 
    lng: 129.689780,
    desc: 'Крытый манеж для занятий.', 
    icon: '🏟️ '
  },
  { 
    id: 'teplica', 
    name: 'Теплица', 
    type: 'greenhouse', 
    lat: 62.008365, 
    lng: 129.688659,
    desc: 'Учебно-опытная теплица.', 
    icon: '🌱 ' 
  },
  { 
    id: 'oktemskiy', 
    name: 'Октемский Филиал (Карапатцы)', 
    type: 'route', 
    lat: 61.677839,
    lng: 129.429316,
    desc: 'Октемский Филиал.', 
    icon: '🏫 ' 
  }
];

// ===== Загрузка пользовательских объектов (если вы добавляли их через кнопку "+") =====
function loadUserObjects() {
  const raw = localStorage.getItem('agromap_objects');
  return raw ? JSON.parse(raw) : [];
}

// ===== Сохранение пользовательских объектов =====
function saveUserObjects(list) {
  localStorage.setItem('agromap_objects', JSON.stringify(list));
}

// ===== Объединённый список (базовые + добавленные пользователем) =====
let OBJECTS = [...BASE_OBJECTS, ...loadUserObjects()];